dictionary = dict( (('小明','21岁'),('小王','22岁'),('小红','21岁')) )
print('原始字典=',dictionary)
# 原始字典= {'小明': '21岁', '小王': '22岁', '小红': '21岁'}
dictionary['小郑']='21岁'  # 添加一个新的键值对
print('添加一个新的键值对后=',dictionary)
# 添加一个新的键值对后= {'小明': '21岁', '小王': '22岁', '小红': '21岁', '小郑': '21岁'}
dictionary['小明']='20岁' # 修改小明的年龄
print('修改小明的年龄=',dictionary)
# 修改小明的年龄= {'小明': '20岁', '小王': '22岁', '小红': '21岁', '小郑': '21岁'}

if '小红' in dictionary:  # 先判断一下小红是否在字典序列中
    del dictionary['小红']  # 删除小红
print('删除小红后=',dictionary)
# 删除小红后= {'小明': '20岁', '小王': '22岁', '小郑': '21岁'}