import  random # 导入random标准库

###### 生成指定范围的数值列表
randomnumber = [random.randint(10,100) for i in range(10)]
print("生成的10个随机数为:",randomnumber)
# 生成的10个随机数为: [43, 93, 68, 23, 45, 22, 43, 23, 12, 42]


######  根据列表生成指定需求的列表
price = [1200,5400,6200,1998,8888]
sale = [int(x*0.5) for x in price]
print('原价格为: ',price)
print('打五折的价格为:',sale)
# 原价格为:  [1200, 5400, 6200, 1998, 8888]
# 打五折的价格为: [600, 2700, 3100, 999, 4444]


###### 从列表中选择符合条件的元素组成新的列表
price = [1200,5400,6200,1998,8888]
sale = [x for x in price if x>5000]
print('原价格:',price)
print('高于5000的价格:',sale)
# 原价格: [1200, 5400, 6200, 1998, 8888]
# 高于5000的价格: [5400, 6200, 8888]